jlckfb/Candis-S31/firmware/demo/sdkconfig.defaults
# Candis-S31 watch demo baseline. Derives from firmware/factory/sdkconfig.defaults
# minus the RF-cert/WDT-off diagnostics knobs, plus NimBLE, CJK font and a
# larger LVGL heap. Performance build: the display pipeline is the product.
CONFIG_IDF_TARGET="esp32s31"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Report peripheral failures instead of aborting on them.
CONFIG_BSP_ERROR_CHECK=n

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# Speed step (WS5): QIO 80 MHz flash. Rollback = revert to DIO/40M and
# reflash. Factory EVT1 overlay proved this grade (35+ reboot cycles, see
# firmware/factory/sdkconfig.qio80_psram200.defaults).
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Single 8 MB app partition (no OTA); see partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PSRAM speed step (WS5): 250 MHz is an official ESP32-S31 Kconfig grade
# (esp_psram/esp32s31/Kconfig.spiram), not an overclock. Validated on the
# new J1-reworked silicon: 35+ reboot cycles plus full-capacity
# mem_psram_verify, see firmware/factory/sdkconfig.qio80_psram250.defaults.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_MEMTEST=y

# Internal RAM budget: two 460x80 LVGL DMA buffers take 147 KB of it, so the
# WiFi driver + NimBLE host cannot also live there (first-flash boot loop:
# esp_wifi_init ESP_ERR_NO_MEM, then a btdm controller assert, 2026-08-21).
# Move the general heap into PSRAM - >=16 KB mallocs prefer PSRAM, WiFi/LWIP
# bulk allocations too, and the NimBLE host pool is external entirely. The
# display buffers stay internal via MALLOC_CAP_DMA and are unaffected.
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# Display: board-local esp_lvgl_port path, QSPI 48 MHz (within the CO5300
# 50 MHz write limit), LVGL PARTIAL, and two 460x48 internal-DMA buffers.
# Only the first chunk of each refresh cycle waits for the GPIO16 TE edge;
# later chunks are pipelined. The full 423200-byte RGB565 frame still needs
# about 17.6 ms on the wire, so the validated targets are ~60 fps for local
# updates and ~30 fps for full-screen traffic. The 2x2 partial-window
# rounder and hidden black first-frame redraw are BSP contracts, not optional
# application workarounds.
CONFIG_BSP_LCD_PIXEL_CLOCK_MHZ=48
CONFIG_BSP_LCD_TE_SYNC=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=48
CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y

# Rendering runs on one SW draw unit; RGB565 byte order is the CO5300
# contract, handled by the BSP/port flush path. CLIB allocators and a single
# SW draw unit are the validated baseline (the
# dual-unit dispatch path spun with zero progress on this board; the
# adapter task serializes rendering).
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
# PPA acceleration route: the adapter's blend/fill handler
# (enable_ppa_accel in the BSP display profile), NOT LVGL's native PPA draw
# unit. CONFIG_LV_USE_PPA must stay disabled: lv_draw_ppa_private.h requires
# CONFIG_LV_DRAW_BUF_ALIGN == CONFIG_CACHE_L2_CACHE_LINE_SIZE, and that
# Kconfig symbol only exists on ESP32-P4 (ESP32-S31 has none), so the native
# unit cannot compile here; LVGL's esp.cmake also links esp_driver_ppa only
# for esp32p4. The adapter path is compile-clean on S31 (its CMake adds
# esp_driver_ppa for esp32s31) and is mutually exclusive with the native
# unit anyway. Keep exactly one SW draw unit: the adapter PPA path requires
# LV_DRAW_SW_DRAW_UNIT_CNT == 1 (dual units spun with zero progress on this
# board).
CONFIG_LV_USE_PPA=n
# Cache-line draw-buffer alignment (S31 dcache line = 64 B, factory-proven
# value): keeps every LVGL draw/layer buffer aligned for the adapter's
# esp_cache_msync writeback and for PPA/DMA transfers.
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_FONT_MONTSERRAT_16=y
# 1 ms tick so the LVGL task paces refresh cycles against the 16.67 ms TE period.
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# app_main drives board bring-up and service startup; 3584 is factory-REPL
# sized, too small for this app (factory stack-protection incident 2026-08-20).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Keep LVGL allocations in a bounded private pool. Using libc malloc sends
# the UI's many small allocations to internal RAM first and eventually
# starves the I2S DMA allocator after navigating several screens.
CONFIG_LV_MEM_SIZE_KILOBYTES=64

# Fonts: Source Han Sans SC 16 CJK as the UI default (Simplified Chinese),
# Montserrat for large digits/labels. Only size 16: 14 px CJK is unreadable
# at 325 ppi.
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=y
CONFIG_LV_FONT_DEFAULT_SOURCE_HAN_SANS_SC_16_CJK=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# BLE host stack: NimBLE (lighter than Bluedroid). Replaces the factory
# controller-only configuration; the controller itself stays enabled.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# WiFi/BLE controller buffer diet. With 147 KB of display DMA buffers the
# internal heap (~237 KB) cannot feed the default driver pools: esp_wifi_init
# returned ESP_ERR_NO_MEM and the BT controller died in
# btdm_osal_elem_mempool_init (2026-08-21). The demo only scans, joins one AP
# and keeps a single BLE link, so the default buffer fleets are pure waste.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
# Advertisement flow-control buffers: 50 is the Kconfig minimum (24 was
# silently clamped back to the 100 default); each slot costs only ~35 B.
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=50

# WiFi stays at IDF defaults (enabled on this target); credentials persist in
# the nvs partition.

# USB Device (CDC) mode for the OTG app (G3): esp_tinyusb from
# main/idf_component.yml, the single non-default knob is the CDC class
# enable - everything else (DMA mode, ESP VID/default PID, 512 B
# buffers, 4 KB task) stays at the values the board-validated
# firmware/usb_cdc_device image used. The TinyUSB device task only
# exists while the port is a Sink (uninstalled on every role change),
# so its ~4 KB internal stack is a transient cost inside the DIRAM
# headroom.
CONFIG_TINYUSB_CDC_ENABLED=y

# Camera (spec E.3): OV5640 DVP preview + capture via esp_video (/dev/video2).
# Drive the OV5640 XCLK from LEDC: the esp_video DVP clock path only supports
# integer dividers and no S31 CAM controller clock source is an integer
# multiple of the required 24 MHz (PLL_F160M 160 % 24 = 16, XTAL 40 % 24 = 16),
# so the controller path hard-fails before sensor detection. The BSP skips it
# when this is set (bsp/candis_s31 Kconfig default y; pinned here for
# visibility because existing sdkconfig files mask Kconfig default changes).
CONFIG_BSP_CAMERA_XCLK_USE_LEDC=y

# OV5640 on the DVP interface; RGB565 big-endian 800x600 at 10 fps is the
# sensor configuration and doubles as the driver's default format.
CONFIG_CAMERA_OV5640=y
# CONFIG_CAMERA_OV5640 only compiles the driver. Registering the sensor with
# esp_video needs the auto-detect entry as well: the DVP detect function in
# esp_cam_sensor's ov5640.c is wrapped in
# #if CONFIG_CAMERA_OV5640_AUTO_DETECT_DVP_INTERFACE_SENSOR, and that option is
# "default n" while the MIPI-CSI one is "default y". ESP32-S31 has
# SOC_LCDCAM_CAM_SUPPORTED but no SOC_MIPI_CSI_SUPPORTED, so leaving this unset
# links an empty detect table: esp_video_init() never creates /dev/video2 and
# camera capture later fails at open() with ESP_ERR_NOT_FOUND.
CONFIG_CAMERA_OV5640_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV5640_DVP_RGB565_BE_800X600_10FPS=y
CONFIG_CAMERA_OV5640_DVP_DEFAULT_FMT_RGB565_BE_800X600_10FPS=y
# Keep the OV3660 detect entry compiled in as well so a Korvo-1 module still
# enumerates without a rebuild; both sensors answer at SCCB 0x3C but each
# detect reads the sensor PID and returns NULL on mismatch (non-fatal).
CONFIG_CAMERA_OV3660=y
# The sensor is controlled over SCCB/I2C on this board, not SPI.
CONFIG_CAM_CTRL_SPI_ENABLE=n
